# SeedName Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DGNExportOptions..::..SeedName Property
DGNExportOptions Class See Also
---
The name of the DGN seed. Default value of seedName is empty.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public string SeedName { get; set; }
```

Visual Basic
---
```text
Public Property SeedName As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ SeedName {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
DGNExportOptions Class
Autodesk.Revit.DB Namespace